<?php

$region = [
    'Московская область' => ['Москва','Абрамцево','Алабино','Апрелевка','Архангельское'],
    'Ленинградская область' => ['Санкт-Петербург','Александровская',
                                    'Бокситогорск','Большая Ижора','Будогощь'],
    'Рязанская область' => ['Рязань','Горняк','Гусь Железный','Елатьма','Ермишь'],
    'Воронежская область' => ['Воронеж','Воробьевка','Верхняя Хава','Бутурлиновка','Калач']
];

foreach ($region as $k => $v){
    echo "\r\n<br>$k:<br>\r\n".implode(', ', $v);
}